'''
Created on 2020. 4. 7.

@author: GD7
'''
#===============================================================================
# 학생1 = ['경민',26]
# 학생2 = ['규철',26]
# 사람 = [학생1, 학생2]
# print(사람)
# 
# for i in 사람:
#     print(i)
#     for j in i:
#         print(j)
#===============================================================================

이름 = ['구디','가산']
나이 = [6,50]
사람 = [이름 , 나이] 
print(사람[0][1])

for 사람수 in range(len(사람[0])):
    #print(사람수)
    #print('이름', 사람[0][사람수])
    #print('나이', 사람[1][사람수])
    for 타입 in range(len(사람)):
        print(사람[타입][사람수])